# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Better alternatives
# https://remysharp.com/2018/08/23/cli-improved
brew "bat" # > cat
brew "diff-so-fancy" # > diff
brew "fd" # > find
brew "fzf" # > ctrl+r
brew "htop" # > top
brew "ncdu" # > du
brew "prettyping" # > ping
brew "tldr" # > man, alias to `help`

# Binaries
brew "composer"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "mas"
brew "mysql"
brew "nginx"
brew "node"
brew "php"
brew "pinentry-mac"
brew "pkg-config"
brew "redis"
brew "tree"
brew "vim"

# General
cask "1password"
cask "alfread"
cask "anki"
cask "discord"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "google-drive-file-stream"
cask "telegram"
cask "tor-browser"
cask "tweetbot"

# Development
cask "android-platform-tools"
cask "docker"
cask "github"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
cask "sublime-text"
cask "tableplus"
cask "wechatwebdevtools"

# Design Tools
cask "adobe-creative-cloud"
cask "figma"

# Fonts
cask "font-fira-code"

# Apps from App Store
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "Breaks For Eyes – Rest On Time", id: 1439431081
mas "Numbers", id: 409203825
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Todoist", id: 585829637
