# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Better alternatives
# https://remysharp.com/2018/08/23/cli-improved
brew "bat" # > cat
brew "diff-so-fancy" # > diff
brew "fd" # > find
brew "fzf" # > ctrl+r
brew "htop" # > top
brew "ncdu" # > du
brew "prettyping" # > ping
brew "tldr" # > man, alias to `help`

# Binaries
brew "composer"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "mysql"
brew "nginx"
brew "php"
brew "pinentry-mac"
brew "pkg-config"
brew "redis"
brew "tree"
brew "vim"

# General
cask "keepassxc"
cask "raycast"
cask "anki"
cask "discord"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "google-drive-file-stream"
cask "telegram"
cask "tor-browser"

# Development
cask "docker"
cask "github"
cask "iterm2"
cask "jetbrains-toolbox"
cask "sublime-text"
cask "tableplus"

# Design Tools
cask "adobe-creative-cloud"
cask "figma"

# Fonts
cask "font-fira-code"
