# Taps
tap "homebrew/cask-fonts"

# Better alternatives
# https://remysharp.com/2018/08/23/cli-improved
brew "bat" # > cat
brew "diff-so-fancy" # > diff
brew "fd" # > find
brew "fzf" # > ctrl+r
brew "htop" # > top
brew "ncdu" # > du
brew "prettyping" # > ping
brew "eza" # > ls

# Binaries
brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "nginx"
brew "php"
brew "composer"
brew "neovim"

# General
cask "keepassxc"
cask "raycast"
cask "karabiner-elements"

# Development
brew "colima"
brew "docker"
cask "iterm2"
cask "sublime-text"
cask "tableplus"

# Design Tools
cask "figma"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
